{"pageProps":{"frontmatter":{"title":"Our New Website Built with React Native","publishedAt":"2022-10-21","description":"Using React Native with the Tamagui framework the build mobile & web apps.","by":"migeran","slug":"our-new-website-with-react-native","readingTime":{"text":"5 min read","minutes":4.975,"time":298500,"words":995}},"code":"var Component=(()=>{var d=Object.create;var o=Object.defineProperty;var h=Object.getOwnPropertyDescriptor;var p=Object.getOwnPropertyNames;var u=Object.getPrototypeOf,f=Object.prototype.hasOwnProperty;var b=(n,t)=>()=>(t||n((t={exports:{}}).exports,t),t.exports),m=(n,t)=>{for(var a in t)o(n,a,{get:t[a],enumerable:!0})},s=(n,t,a,i)=>{if(t&&typeof t==\"object\"||typeof t==\"function\")for(let r of p(t))!f.call(n,r)&&r!==a&&o(n,r,{get:()=>t[r],enumerable:!(i=h(t,r))||i.enumerable});return n};var w=(n,t,a)=>(a=n!=null?d(u(n)):{},s(t||!n||!n.__esModule?o(a,\"default\",{value:n,enumerable:!0}):a,n)),g=n=>s(o({},\"__esModule\",{value:!0}),n);var c=b((N,l)=>{l.exports=_jsx_runtime});var x={};m(x,{default:()=>k,frontmatter:()=>y});var e=w(c()),y={title:\"Our New Website Built with React Native\",publishedAt:\"2022-10-21\",description:\"Using React Native with the Tamagui framework the build mobile & web apps.\",by:\"migeran\"};function v(n={}){let{wrapper:t}=n.components||{};return t?(0,e.jsx)(t,Object.assign({},n,{children:(0,e.jsx)(a,{})})):a();function a(){let i=Object.assign({h2:\"h2\",p:\"p\",ul:\"ul\",li:\"li\",em:\"em\",a:\"a\"},n.components),{Notice:r}=i;return r||R(\"Notice\",!0),(0,e.jsxs)(e.Fragment,{children:[(0,e.jsx)(r,{children:\"Our new website is a work in progress, please let us know what more you would like to see.\"}),`\n`,(0,e.jsx)(i.h2,{id:\"why-react-native\",children:\"Why React Native?\"}),`\n`,(0,e.jsx)(i.p,{children:\"Our website needed an overhaul for quite some time now. When deciding on how exactly we wanted to build our new website, we considered a variety of options:\"}),`\n`,(0,e.jsxs)(i.ul,{children:[`\n`,(0,e.jsx)(i.li,{children:\"Using a SaaS Website Builder like Wix or Squarespace\"}),`\n`,(0,e.jsx)(i.li,{children:\"Using a self-hosted website solution like Wordpress or Drupal\"}),`\n`,(0,e.jsx)(i.li,{children:\"or build a custom website using React\"}),`\n`]}),`\n`,(0,e.jsx)(i.p,{children:\"We have been working with React and React Native for a long time and understand its strengths and limitations well. We also have been experts at creating cross-platform applications for over a decade - we built cross-platform mobile apps in Java targeting 4 different mobile platforms (J2ME, BlackBerry, Android and iOS) from one code base back in the early 2010s.\"}),`\n`,(0,e.jsx)(i.p,{children:\"Based on our experience we believe that using React Native for Mobile, Web and even the Desktop (e.g. using Electron as a shell or with React Native for Windows) is the next logical step for cross-platform app development.\"}),`\n`,(0,e.jsxs)(i.h2,{id:\"is-a-website-really-an-app\",children:[\"Is a Website \",(0,e.jsx)(i.em,{children:\"really\"}),\" an App?\"]}),`\n`,(0,e.jsx)(i.p,{children:\"A company website's core function is to aid the company's business in multiple ways:\"}),`\n`,(0,e.jsxs)(i.ul,{children:[`\n`,(0,e.jsx)(i.li,{children:\"increase brand awareness\"}),`\n`,(0,e.jsx)(i.li,{children:\"build a following\"}),`\n`,(0,e.jsx)(i.li,{children:\"provide means to purchase the goods and services offered by the company.\"}),`\n`]}),`\n`,(0,e.jsx)(i.p,{children:\"To achieve these goals a website needs to be more than just a collection of static pages:\"}),`\n`,(0,e.jsxs)(i.ul,{children:[`\n`,(0,e.jsx)(i.li,{children:\"It needs to include lead generation functions, even if it is only a simple contact or newsletter signup form.\"}),`\n`,(0,e.jsx)(i.li,{children:\"It needs to include webshop functionality if there are services or products offered for purchase directly on the website\"}),`\n`,(0,e.jsxs)(i.li,{children:[\"It should provide a way to \",(0,e.jsx)(i.em,{children:\"customize the user experience\"}),\" for each visitor depending on their journey with the company: if they are a first-time or returning visitor, if they already signed up for the newsletter or if they are already a customer.\"]}),`\n`,(0,e.jsx)(i.li,{children:\"Finally, it should have an easy-to-use backend UI for the company to manage the collected data, upload and edit content, design new marketing campaigns ... etc.\"}),`\n`]}),`\n`,(0,e.jsx)(i.p,{children:\"All these require dynamic functionality both on the client side and the server side, which means that we are talking about a full-fledged web application.\"}),`\n`,(0,e.jsx)(i.h2,{id:\"single-framework-for-web-and-mobile\",children:\"Single Framework for Web and Mobile\"}),`\n`,(0,e.jsxs)(i.p,{children:[\"In today's mobile-first world, as a company grows a \",(0,e.jsx)(i.em,{children:\"true mobile app\"}),\" will be required to provide an even better experience for its customers and match the offerings of their competitors.\"]}),`\n`,(0,e.jsx)(i.p,{children:\"Traditionally, such mobile apps would be developed separately from the website frontend and even in the best case, only share the backend of the web application.\"}),`\n`,(0,e.jsx)(i.p,{children:\"Using related frameworks, like React for the website and React Native for the mobile app helps because both teams can use the same technologies and tooling. But direct code sharing is limited to the business logic and requires careful abstraction of the user interface and platform-specific code base by both teams.\"}),`\n`,(0,e.jsx)(i.p,{children:\"Using React Native for Web is a solution for this problem by reimplementing React Native UI primitives (like Views, Lists ... etc.) using web components that work in the browser.\"}),`\n`,(0,e.jsx)(i.p,{children:\"A growing number of third-party React Native components now also support the Web as a 3rd platform in addition to Android and iOS.\"}),`\n`,(0,e.jsx)(i.p,{children:\"This approach, first used by Twitter in their Mobile Web App, greatly increases the code-sharing possibilities and allows a single frontend team to work on both the web and the mobile applications.\"}),`\n`,(0,e.jsx)(i.h2,{id:\"what-is-tamagui\",children:\"What is Tamagui?\"}),`\n`,(0,e.jsx)(i.p,{children:\"Using stock React Native (and React Native for Web) and building everything in-house on top of it is possible, but ignores a lot of great libraries and frameworks that are already available as open-source components.\"}),`\n`,(0,e.jsxs)(i.p,{children:[\"There is already a growing number of \",(0,e.jsx)(i.em,{children:\"universal app\"}),\" libraries that target both Mobile and Web apps, like \",(0,e.jsx)(i.a,{href:\"https://nativebase.io\",children:\"NativeBase\"}),\" or \",(0,e.jsx)(i.a,{href:\"https://www.dripsy.xyz/\",children:\"Dripsy\"}),\".\"]}),`\n`,(0,e.jsxs)(i.p,{children:[\"We chose \",(0,e.jsx)(i.a,{href:\"https://tamagui.dev\",children:\"Tamagui\"}),\", a new framework in this space for the following reasons:\"]}),`\n`,(0,e.jsxs)(i.ul,{children:[`\n`,(0,e.jsx)(i.li,{children:\"Ease of Use\"}),`\n`,(0,e.jsx)(i.li,{children:\"Flexible styling system\"}),`\n`,(0,e.jsx)(i.li,{children:\"Superior Performance\"}),`\n`,(0,e.jsx)(i.li,{children:\"First-class support for responsive server-side rendering on the Web.\"}),`\n`]}),`\n`,(0,e.jsx)(i.h2,{id:\"release-early-release-often\",children:\"Release early, release often\"}),`\n`,(0,e.jsx)(i.p,{children:\"Following the old mantra from the open-source and free software movement, we are releasing today the first version of our new website, built on React Native with Tamagui. This is now a mostly static frontend pre-generated using NextJS.\"}),`\n`,(0,e.jsxs)(i.p,{children:[\"On the website, you can check out the services we offer, our current and past projects and you may \",(0,e.jsx)(i.a,{href:\"/contact\",children:\"contact us\"}),\" easily if you have a question or would like to use our services.\"]}),`\n`,(0,e.jsx)(i.h2,{id:\"going-forward\",children:\"Going Forward\"}),`\n`,(0,e.jsxs)(i.p,{children:[\"We are already working on the next steps. To quickly create content, a Visual Editor with a backend CMS is essential. We are already working on a visual editor for React & React Native using \",(0,e.jsx)(i.a,{href:\"https://frappeframework.com\",children:\"Frappe Framework\"}),\" and \",(0,e.jsx)(i.a,{href:\"https://erpnext.com\",children:\"ERPNext\"}),\" as the backend.\"]}),`\n`,(0,e.jsxs)(i.p,{children:[(0,e.jsx)(i.a,{href:\"\",children:\"Sign up for our newsletter\"}),\" to be the first to know about updates on this topic or any other insights that we share.\"]}),`\n`,(0,e.jsx)(i.h2,{id:\"about-migeran\",children:\"About Migeran\"}),`\n`,(0,e.jsx)(i.p,{children:\"Migeran is a full-service software engineering company. In the past 15 years, we have been delivering software projects for our clients in a large variety of markets using a broad set of technologies, including:\"}),`\n`,(0,e.jsxs)(i.ul,{children:[`\n`,(0,e.jsx)(i.li,{children:\"AR / VR solutions based on Godot Engine and Unreal Engine\"}),`\n`,(0,e.jsx)(i.li,{children:\"Native and cross-platform mobile apps built in Java / Kotlin, Swift / Objective-C and JavaScript / TypeScript with React Native.\"}),`\n`,(0,e.jsx)(i.li,{children:\"Business applications based on Web and Mobile frontends and Java, Python, Ruby and PHP backend\"}),`\n`]}),`\n`,(0,e.jsx)(i.p,{children:\"Our first own product, Migeran for iOS was acquired by Intel in 2015 and released as the Multi-OS Engine.\"}),`\n`,(0,e.jsxs)(i.p,{children:[\"We are available for new projects, you may \",(0,e.jsx)(i.a,{href:\"/contact\",children:\"contact us\"}),\" if you would like to learn more or have a project that you would like to discuss with us.\"]})]})}}var k=v;function R(n,t){throw new Error(\"Expected \"+(t?\"component\":\"object\")+\" `\"+n+\"` to be defined: you likely forgot to import, pass, or provide it.\")}return g(x);})();\n;return Component;","relatedPosts":null},"__N_SSG":true}